Revit 2027 API
Truss.GetTrussMemberInfo Method
Query if a given element is a member of a truss, its lock status and its usage, etc.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TrussMemberInfo GetTrussMemberInfo(
	ElementId elemId
)
Public Function GetTrussMemberInfo (
	elemId As ElementId
) As TrussMemberInfo
public:
TrussMemberInfo^ GetTrussMemberInfo(
	ElementId^ elemId
)
member GetTrussMemberInfo :
        elemId : ElementId -> TrussMemberInfo
Parameters
elemId ElementId
The querying element.
Return Value
TrussMemberInfo
A struct TrussMemberInfo that contains the querying element's host truss, whether to lock to the truss, usage type, etc.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace